{
  "front-end": {
    "installer": {
      "titre": "Installer et configurer son environnement de travail en fonction du projet web ou web mobile",
      "competence": 1,
      "description": "<p>En tenant compte de l’environnement technique défini dans le dossier de conception, installer et configurer sur son poste de travail tous les outils de développement nécessaires à son environnement de travail, y compris en anglais. </p> <p>Afin de pouvoir travailler en équipe, installer et utiliser un outil de gestion des versions et de collaboration. Afin de reconstituer sur son poste de travail un environnement conforme à celui de production, paramétrer des conteneurs pour son environnement de développement et les utiliser pour implémenter les services requis.</p><p>Comprendre la documentation technique des outils nécessaires à l’environnement de travail, en langue française ou anglaise.</p><p> Réaliser une veille technologique sur les évolutions techniques et les problématiques de sécurité en lien avec l’installation et la configuration d’un environnement de travail.</p>"
    },
    "maquetter": {
      "titre": "Maquetter des interfaces utilisateur web ou web mobile",
      "competence": 2,
      "description": "<p>À partir du dossier de conception comprenant le recueil des besoins des utilisateurs et les éléments de conception, réaliser les maquettes des interfaces utilisateur web ou web mobile, y compris en anglais.</p><p> Respecter la charte graphique de l’entreprise.</p><p> Tenir compte des exigences de sécurisation et de l’expérience utilisateur, y compris de l’utilisateur en situation de handicap.</p><p> Tenir compte du type d’utilisation de l’interface utilisateur, y compris pour les équipements mobiles.</p><p> Modéliser l’enchainement des interfaces utilisateur web ou web mobile à l’aide d’un schéma.</p><p> Respecter la législation en vigueur, y compris celle relative à l’accessibilité. Identifier les besoins d’éco-conception.</p>"
    },
    "interfaces": {
      "titre": "Réaliser des interfaces utilisateur statiques web ou web mobile",
      "competence": 3,
      "description": "<p>A partir du dossier de conception, des maquettes et de leur enchaînement, réaliser les interfaces utilisateur web ou web mobile statiques en tenant compte de l’expérience utilisateur, y compris pour les personnes en situation de handicap.</p><p> Prendre en compte les besoins d’éco-conception.</p><p> Respecter les recommandations de sécurité liées aux applications web et web mobile et la règlementation en vigueur, y compris celle relative à l’accessibilité.</p><p> Adapter l’interface au type d’utilisation de l’application, y compris pour les équipements mobiles.</p><p> Pour les sites web, publier de manière sécurisée les pages web statiques sur un serveur web et les rendre visibles à l’aide du référencement sur les moteurs de recherche suivant le public visé.</p><p> Réaliser un jeu d’essai fonctionnel et les tests unitaires des composants. Documenter sa réalisation, y compris en anglais.</p>"
    },
    "dynamique": {
      "titre": "Développer la partie dynamique des interfaces utilisateur web ou web mobile",
      "competence": 4,
      "description": "<p>À partir d’une interface utilisateur statique web ou web mobile et du dossier de conception, développer côté client, avec un langage de programmation de scripts, les traitements permettant d’obtenir une interface utilisateur web dynamique, y compris pour les équipements mobiles.</p><p> Améliorer l’expérience utilisateur, y compris pour les personnes en situation de handicap. Respecter les recommandations de sécurité liées aux applications web et web mobile et la réglementation en vigueur, y compris celle relative à l’accessibilité. Documenter le code, y compris en anglais.</p><p> Vérifier la qualité du code, éventuellement à l’aide d’un utilitaire de contrôle de qualité de code.</p><p> Réaliser un jeu d’essai fonctionnel et les tests unitaires des composants.</p><p> Réaliser les tests de sécurité. </p><p>Déterminer une démarche structurée de résolution de problème en cas de découverte d’un dysfonctionnement lors de l’analyse des résultats des tests unitaires ou de sécurité.</p>"
    }
  },
  "back-end": {
    "donnees": {
      "titre": "Mettre en place une base de données relationnelle",
      "competence": 5,
      "description": "<p>A partir du dossier de conception comprenant le recueil des besoins des utilisateurs et le schéma conceptuel des données, définir le schéma physique des données.</p><p> Respecter les règles des bases de données relationnelles et les règles de nommage en vigueur dans l’entreprise.</p><p> Assurer la sécurité, la confidentialité et l’intégrité des données.</p><p> A partir du schéma physique, mettre en place la base de données de tests.</p><p> A partir du dossier de conception, créer les utilisateurs et leurs droits d’accès dans la base de tests.</p><p> Créer un jeu d’essai complet dans une base de données de test et sauvegarder la base de données de test afin de pouvoir la restaurer.</p><p> Comprendre la documentation technique de la base de données, y compris en anglais.</p>"
    },
    "composants": {
      "titre": "Développer des composants d’accès aux données SQL et NoSQL",
      "competence": 6,
      "description": "<p>En tenant compte de la structure de la base de données et du dossier de conception, coder les traitements relatifs aux accès aux données en consultation, modification, création et suppression.</p><p> S’assurer que les traitements gèrent l’intégrité des données et les conflits d'accès aux données, et qu’ils permettent de respecter la confidentialité et de prendre en compte les cas d’exception.</p><p> Valider et contrôler les entrées dans les composants serveurs sécurisés avant la mise à jour de la base de données.</p><p> Réaliser les tests unitaires et de sécurité.</p><p> Déterminer une démarche structurée de résolution de problème en cas de découverte d’un dysfonctionnement lors de l’analyse des résultats des tests unitaires et de sécurité.</p><p> Réaliser une veille technologique sur les évolutions techniques et les problématiques de sécurité liées aux bases de données SQL et NoSQL.</p>"
    },
    "comps_server": {
      "titre": "Développer des composants métier coté serveur",
      "competence": 7,
      "description": "<p>A partir du dossier de conception, développer les traitements de l'application coté serveur avec des composants métier sécurisés, dans un style défensif, et éventuellement en asynchrone.</p><p> Respecter les bonnes pratiques de la programmation orientée objet et les règles de nommage décrites dans les normes de qualité de l’entreprise.</p><p> Documenter le code y compris en langue anglaise.</p><p> Vérifier la qualité du code, éventuellement à l’aide d’un utilitaire de contrôle de qualité de code.</p><p> Réaliser un jeu d’essai fonctionnel et les tests unitaires des composants.</p><p> Réaliser les tests de sécurité.</p><p> Déterminer une démarche structurée de résolution de problème en cas de découverte d’un dysfonctionnement lors de l’analyse des résultats des tests unitaires ou de sécurité.</p>"
    },
    "documents": {
      "titre": "Documenter le déploiement d’une application dynamique web ou web mobile",
      "competence": 8,
      "description": "<p>En tenant compte des dépendances et des versions de l’application, rédiger ou mettre à jour la procédure de déploiement de l’application.</p><p> Ecrire et documenter les scripts de déploiement.</p><p> Réaliser une veille technologique sur les évolutions techniques et les problématiques de sécurité liées au déploiement d’une application web ou web mobile, y compris dans le cadre d’une démarche DevOps.</p>"
    }
  },
  "traversales": {
    "communiquer": {
      "titre": "Communiquer en français et en anglais",

      "description": "<p>Afin de connaître les fonctionnalités et les besoins de sécurité de l’application web ou web mobile, analyser le dossier de conception et solliciter si nécessaire des informations complémentaires auprès d’interlocuteurs divers. Être à l’écoute du client pour développer une application web ou web mobile correspondant à ses besoins. Présenter ses réalisations au client, oralement en face-à-face ou à distance, ou par écrit, en adaptant son langage au client tout au long de l’interaction.</p><p> Lors des réunions techniques, en face-à-face ou à distance, suivre activement les échanges, s’exprimer devant les participants de manière structurée et constructive et argumenter ses propositions, y compris en anglais.</p><p> Savoir adapter sa communication lors d’échanges avec des personnes en situation de handicap.</p><p> Rédiger des dossiers techniques dans un langage adapté au destinataire et formuler ses courriels professionnels de manière claire et concise. Rechercher des informations dans des documents techniques et communiquer si besoin au sujet des contenus.</p><p> Niveaux requis en anglais selon le Cadre européen commun de référence pour les langues (CECRL) : - Expression écrite, compréhension écrite et compréhension orale : niveau B1. - Expression orale : niveau A2.</p>"
    },
    "resolution": {
      "titre": "Mettre en œuvre une démarche de résolution de problème",

      "description": "<p>En présence d’un problème de dysfonctionnement d’un applicatif, déterminer une démarche structurée de diagnostic de résolution de problèmes adaptée au dysfonctionnement afin d’en comprendre l'origine et de le résoudre.</p><p> Identifier les tests logiciels appropriés, déduits de la démarche de résolution de problèmes permettant de trouver la cause du problème.</p><p> Prévoir dans les tests tous les cas nécessaires à la résolution du problème.</p><p> Réaliser dans un ordre logique les tests et en analyser les résultats. Rétablir la situation et vérifier le bon fonctionnement de l’application.</p>"
    },
    "continu": {
      "titre": "Apprendre en continu",

      "description": "<p>Pour maintenir ses compétences et sa capacité opérationnelle dans l’emploi, mettre en place un système de veille technologique permettant de suivre l’actualité des évolutions technologiques et des problématiques de sécurité des applications web ou web mobiles.</p><p> Pour résoudre des problèmes, s’auto-former en recherchant des informations sur Internet ou dans des documentations techniques, y compris en anglais, et en sollicitant l’appui des personnes compétentes.</p>"
    }
  },
  "reac": {
    "reac": {
      "titre": "Développeur Web et Mobile de niveau 5",
      "description": "<p>Le document fournit un guide de référence pour le titre professionnel de \"Développeur Web et Mobile Web\" de niveau 5. Il donne un aperçu de l'évolution du titre, du contexte de l'examen professionnel, d'une liste d'activités, d'une description du rôle professionnel et des compétences requises.</p><p>Le titre professionnel comprend deux blocs de compétences : \"Développer le front-end d'une application web ou mobile web sécurisée\" et \"Développer le back-end d'une application web ou mobile web sécurisée\". Le rôle professionnel exige que le développeur respecte les spécifications de conception, utilise les langages appropriés pour le développement web, se conforme aux réglementations et recommandations de sécurité, et tienne compte des besoins des utilisateurs, y compris ceux en situation de handicap.</p><p>Le développeur doit également avoir des connaissances en concepts informatiques, méthodes de conception et techniques de développement, ainsi que des compétences en communication en français et en anglais. Deux nouveaux éléments qui ont un impact sur le rôle professionnel sont l'utilisation généralisée de méthodologies de gestion de projet itératives, telles que Agile, qui nécessitent des versions de production fréquentes, et l'utilisation de l'intégration et du déploiement continus (CI/CD) grâce à l'approche DevOps.</p><p>De plus, le concept de résilience informatique, qui inclut la continuité de service du système d'information d'une organisation, a conduit à l'évolution des environnements de production vers des architectures distribuées et l'utilisation de services cloud, de microservices et de conteneurs. Les compétences liées au développement d'interfaces utilisateur web ou mobile web statiques sont regroupées, indépendamment de la technologie utilisée.</p><p>Le développeur est responsable de la documentation du déploiement d'applications web ou mobile web dynamiques et de la garantie de la sécurité et de la qualité du processus de déploiement. Le rôle professionnel comprend également l'utilisation de logiciels collaboratifs, d'outils d'automatisation pour les tests unitaires et le contrôle de la qualité du code, et la configuration et l'utilisation de conteneurs dans un environnement de développement.</p><p>Le titre professionnel de \"Développeur Web et Mobile Web\" peut conduire à diverses opportunités d'emploi, notamment travailler pour des entreprises de services numériques, des entreprises de solutions logicielles ou en tant que travailleur indépendant. Le travail nécessite une position assise prolongée et un travail continu sur écran, et peut impliquer des déplacements et du travail à distance.</p><p>Le document fournit une liste d'activités et de compétences professionnelles pour le rôle, comprenant des compétences techniques, organisationnelles et de communication. En résumé, le document décrit le rôle professionnel d'un Développeur Web et Mobile Web de niveau 5, y compris les compétences requises et la nature évolutive de l'industrie. Il met l'accent sur l'importance de la sécurité, de l'expérience utilisateur et de l'adaptabilité aux différentes méthodologies de développement.</p><p>Le rôle professionnel implique le développement à la fois du front-end et du back-end d'applications web ou mobile web sécurisées, en utilisant les langages et technologies appropriés, et en respectant les normes et réglementations en vigueur.</p>"
    }
  },
  "rev2": {
    "rev2": {
      "titre": "Référentiel pour le titre professionnel DWWM",
      "description": "<p>Ce document est une référence exhaustive détaillant le processus d'évaluation pour le titre professionnel de Développeur Web et Web Mobile (DWWM), répertorié sous le code TP-01280 à sa version 04. Il offre une vue approfondie des méthodes, des exigences et des critères d'évaluation spécifiques à ce titre.</p><p>L'évaluation des candidats est conduite par un jury en tenant compte des modalités d'évaluation stipulées dans le document, de leur dossier professionnel, des évaluations antérieures en cours de formation et d'un entretien avec le jury. Les postulants doivent élaborer un dossier de projet imprimé et une présentation sous forme de diaporama englobant la globalité de leurs projets. Ce dossier devra comprendre:</p><p><ul> <li>Une liste des compétences couvertes <li>Le contexte du projet</li> <li>La présentation de l'entreprise</li> <li>Le cahier des charges</li> <li>Les contraintes du projet</li> <li>Les livrables attendus</li> <li>Les réalisations du candidat en matière de code, de sécurité et de jeu d'essai.</li></ul></p> <p>Le processus d'évaluation comprend également un questionnement du jury basé sur le dossier de projet et la présentation du candidat. Le jury évalue les compétences impliquées dans les projets présentés et pose des questions complémentaires pour évaluer celles qui n'ont pas été abordées. Les compétences évaluées incluent:</p><p><ul> <li>La conception des interfaces graphiques</li> <li>Le développement front-end et back-end</li> <li>L'installation et la configuration de l'environnement de travail</li><li>La documentation du déploiement</li><li>La résolution de problèmes</li><li>La communication en français et en anglais</li><li>D'autres compétences spécifiques au développement web et web mobile.</li></ul></p><p>Les locaux d'évaluation doivent être équipés de systèmes de vidéo-projection, de tables, de chaises, de postes de travail avec accès internet bloqué, et doivent respecter des conditions de surveillance et de confidentialité. Le processus d'évaluation inclut également des critères détaillés pour chaque compétence, tels que le respect des bonnes pratiques de programmation, la conformité aux normes de qualité, la documentation du code source, ainsi que la réalisation de tests fonctionnels et de sécurité.</p> <p>Pour résumer, ce document offre une vision exhaustive du processus d'évaluation pour le titre DWWM. Il couvre en détail les exigences pour les projets, les critères d'évaluation, l'interaction avec le jury, la durée des épreuves, les locaux d'évaluation et les conditions de surveillance. Les compétences évaluées englobent divers aspects du développement web et web mobile, le processus d'évaluation reposant sur des critères spécifiques pour chacune d'elles.</p>"
    }
  }
}
